# Taps
tap "hashicorp/tap"

# --- Core CLI Tools ---
brew "git"
brew "gh"
brew "wget"
brew "jq"
brew "tree"
brew "bat"
brew "ripgrep"
brew "fzf"
brew "htop"
brew "pv"
brew "watch"
brew "lazygit"
brew "tmux"
brew "xz"

# --- Editors ---
brew "neovim"

# --- Shell ---
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Languages & Runtimes ---
brew "go"
brew "nvm"
brew "pyenv"
brew "php"
brew "php@8.3"
brew "composer"

# --- Go Tools ---
brew "cobra-cli"
brew "sqlc"

# --- Database Clients ---
brew "pgcli"
brew "postgresql@15", restart_service: :changed
brew "mysql-client"

# --- DevOps & Cloud ---
brew "awscli"
brew "doctl"
brew "hashicorp/tap/terraform"
brew "infracost"
brew "kubernetes-cli"
brew "kustomize"
brew "kind"
brew "minikube"

# --- Build & Compile ---
brew "gcc"
brew "protobuf"

# --- Security ---
brew "gnupg"

# --- Media & Docs ---
brew "ffmpeg"
brew "imagemagick"
brew "graphviz"
brew "pandoc"

# --- API Tools ---
brew "grpcurl"
brew "vercel-cli"

# --- Applications ---
cask "ghostty"
cask "visual-studio-code"
cask "cursor"
cask "zed"
cask "sublime-text"
cask "goland"
cask "phpstorm"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "figma"
cask "google-chrome"
cask "firefox"
cask "discord"
cask "slack"
cask "spotify"
cask "thunderbird"
cask "postman"
cask "rapidapi"
cask "dbeaver-community"
cask "sequel-ace"
cask "redis-insight"
cask "nosql-workbench"
cask "rectangle"
cask "raycast"
cask "mullvad-vpn"
cask "eqmac"
cask "iterm2"
cask "linear-linear"
cask "protege"
cask "session-manager-plugin"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"

# --- VS Code Extensions ---
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "pkief.material-icon-theme"
vscode "emilijanmb.sublime-text-4-theme"
vscode "nathanridley.autotrim"
vscode "formulahendry.code-runner"
vscode "ritwickdey.liveserver"
vscode "wix.vscode-import-cost"
vscode "golang.go"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"
vscode "ms-python.vscode-python-envs"
vscode "redhat.java"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-gradle"
vscode "ms-vscode.makefile-tools"
vscode "dsznajder.es7-react-js-snippets"
vscode "xabikos.javascriptsnippets"
vscode "ecmel.vscode-html-css"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "docker.docker"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "infracost.infracost"
vscode "mrcrowl.hg"
vscode "mythmon.idl"

# --- Go Binaries ---
go "github.com/bootdotdev/bootdev"
go "github.com/divan/expvarmon"
go "golang.org/x/tools/cmd/goimports"
go "github.com/pressly/goose/v3/cmd/goose"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/rakyll/hey"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
